In [1]:
import pandas as pd
import numpy as np

In [2]:
titles = pd.read_csv('data/titles.csv')
titles.head()

                            title  year
0                        Anita B.  2014
1                   Bloody Border  2013
2  Mademoiselle Josette, ma femme  1914
3                   Super Heal Me  2014
4         R and J: The True Story  2012

In [3]:
cast_1 = pd.read_csv("data/cast/cast_1.csv")
cast_2 = pd.read_csv("data/cast/cast_2.csv")
cast_3 = pd.read_csv("data/cast/cast_3.csv")

cast = pd.concat([cast_1, cast_2, cast_3])
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [4]:
# Using groupby(), find the number of films
# that have been released each decade in the history of cinema.

t = titles
sol = t.groupby(t.year // 10 * 10).size()
sol

year
1890        3
1900       39
1910     6799
1920     9034
1930    10388
1940     8718
1950    12934
1960    17976
1970    19526
1980    21034
1990    22992
2000    39452
2010    75733
2020      285
2110        1
dtype: int64

In [6]:
# Use groupby() to find the number of "Hamlet" films made each decade.

t = titles
t = t[t.title == 'Hamlet']
sol = t.groupby(t.year // 10 * 10).size()
sol

year
1910    3
1920    1
1940    1
1950    1
1960    2
1970    2
1980    1
1990    2
2000    2
2010    5
dtype: int64

In [7]:
# How many leading (n=1) roles were available to actors,
# and how many to actresses, in each year of the 1950s?

c = cast
c = c[c.year // 10 == 195]
c = c[c.n == 1]
c.groupby(['year', 'type']).size()

year  type
1950  actor      603
      actress    267
1951  actor      626
      actress    272
1952  actor      590
      actress    282
1953  actor      629
      actress    283
1954  actor      620
      actress    298
1955  actor      602
      actress    263
1956  actor      609
      actress    284
1957  actor      703
      actress    281
1958  actor      695
      actress    273
1959  actor      672
      actress    286
dtype: int64

In [8]:
# In the 1950s decade taken as a whole,
# how many total roles were available to actors,
# and how many to actresses, for each "n" number 1 through 5?

c = cast
c = c[c.year // 10 * 10 == 1950]
c = c[c.n < 6]
c.groupby(['n', 'type']).size()

n  type
1  actor      6349
   actress    2789
2  actor      4354
   actress    4375
3  actor      5370
   actress    3005
4  actor      5370
   actress    2735
5  actor      5403
   actress    2426
dtype: int64

In [9]:
# Use groupby() to determine how many roles are listed
# for each of the Pink Panther movies.

c = cast
c = c[c.title == 'The Pink Panther']
c = c.sort_values('n').groupby(['year'])[['n']].max()
c

       n
year
1963  15
2006  50

In [10]:
# List, in order by year, each of the films
# in which Frank Oz has played more than 1 role.

c = cast
c = c[c.name == 'Frank Oz']
g = c.groupby(['year', 'title']).size()
g[g > 1]

year  title
1979  The Muppet Movie                            8
1981  An American Werewolf in London              2
      The Great Muppet Caper                      6
1982  The Dark Crystal                            2
1984  The Muppets Take Manhattan                  7
1985  Sesame Street Presents: Follow that Bird    3
1992  The Muppet Christmas Carol                  7
1996  Muppet Treasure Island                      4
1999  Muppets from Space                          4
      The Adventures of Elmo in Grouchland        3
dtype: int64

In [11]:
# List each of the characters that Frank Oz
# has portrayed at least twice.

c = cast
c = c[c.name == 'Frank Oz']
g = c.groupby(['character']).size()
g[g > 1].order()

character
Grover            2
Bert              3
Cookie Monster    3
Fozzie Bear       4
Sam the Eagle     5
Yoda              5
Animal            6
Miss Piggy        6
dtype: int64